#!/usr/bin/env python
# coding: utf-8

# # 1.ให้ นศ. เขียนโปรแกรมคำนวณภาษีที่ต้องจ่ายโดยมีัตราภาษีคงที่เท่ากับ 7 เปอร์เซ็นต์ กำหนดให้ตัวแปรภาษ๊เป็นค่าคงที่ แล้วให้ผู้ใช้งานป้อนจำนวนเงินผ่านทางคียืบอร์ด

# In[15]:





# # 2.จงเขียนโปรแกรมเปียบเทียบตัวเลขที่รับเข้ามาผ่านทางคีย์บอร์ดจำนวน 2 ตัว กำหนดให้ ถ้าตัวเลขตัวที่ 1 มีค่ามากกว่าตัวเลขตัวที่ 2 ให้แสดงข้อความว่า "ตัวเลขตัวที่ 1 มีค่ามากกว่า ตัวเลขที่ 2 " ถ้าตัวเลขที่ 1 มีค่าน้อยกว่าตัวเลขตัวที่ 2 ให้แสดงข้อความว่า "ตัวเลขตัวที่ 1 มีค่าน้อยกว่า ตัวเลขที่ 2 " หากป้อนตัวเลขตัวที่ 1 มีค่่าเท่ากับ ตัวเลขตัวที่ 2 ให้แสดงข้อความว่า "ตัวเลขทั้งสองมีค่าเท่ากัน"

# In[ ]:





# # 3.จงเขียนโปรแกรมวนซ้ำโดยบังคับใช้คำสั่ง While ให้แสดงว่า "Hello" จำนวน 5 บรรทัด 

# In[12]:


input 5:("Hello")
print(while)


# # 4.จงเขียนโปรแกรมวนซ้ำโดยใช้คำสั่ง for ให้แสดงสูตรคูณแม่ 2

# In[34]:


for k in range(2,24) :    
    print(k)    
    k += 2    
    print(k)


# In[ ]:





# In[ ]:




